Autodesk.Revit.Utility.Asset.AssetType
Type of the item the asset represents.
Remarks: See AssetPropertyType for all available asset types.

Autodesk.Revit.Utility.Asset.Title
The title of the asset.

Autodesk.Revit.Utility.Asset.LibraryName
The name of the library the asset belongs to.

Autodesk.Revit.Utility.Asset
Represents the properties of a material pertinent to rendering.